<?php include './header.php'; ?>

  <h2>Форма обратной связи</h2>
  <!--Данные введенные пользователем обрабатываются кодом в mail.php-->
  <form action="./mail.php" method="post">
  <!--Тег задает заголовок для групповых элементов-->
  <legend>Оставьте сообщение:</legend>
  Ваше имя: 
  <!--Устанавливает однострочное текстовое поле ввода:-->
  <input type="text" name="name"  placeholder="Укажите ФИО">
  <!--Используется для полей ввода, которые должны содержать адрес электронной почты.-->
  E-mail:
  <input type="text" name="email" placeholder="Укажите e-mail">
  Номер телефона:
  <input type="text" name="phone" placeholder="Введите номер">
  Сообщение:
  <!--Тег разрешает многострочный ввод текста.-->
    <!--Текстовая область может содержать неограниченное количество символов-->
  <textarea rows="10" cols="45" name="message"></textarea>
  <!--Устанавливает кнопку для отправки данных формы в обработчик формы.-->
  <input type="submit" value="Отправить сообщение">
  </fieldset>
  </form>

</body>
</html>